tap "alextodicescu/tgenv"
tap "derailed/popeye"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "little-angry-clouds/my-brews"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Core application library for C
brew "glib"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Safe, concurrent, practical language
brew "rust"
# Cargo subcommand for displaying when Rust dependencies are out of date
brew "cargo-outdated"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Platform built on V8 to build network applications
brew "node@18"
# Tool to build, change, and version infrastructure
brew "terraform"
# Cloud Development Kit for Terraform
brew "cdktf"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# Platform keystore credential helper for Docker
brew "docker-credential-helper", link: false
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Activates NFS on docker-machine
brew "docker-machine-nfs"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Package manager for kubectl plugins
brew "krew"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Validate Kubernetes configuration files, supports multiple Kubernetes versions
brew "kubeval"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Utility for directing compilation
brew "make"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv", link: false
# Emulator for x86 and PowerPC
brew "qemu"
# Tool for managing OCI containers and pods
brew "podman"
# Tool for creating isolated virtual python environments
brew "virtualenv", link: false
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Password generator
brew "pwgen"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Zsh prompt for Astronauts
brew "spaceship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# UNIX shell (command interpreter)
brew "zsh"
# A Kubernetes Cluster sanitizer and linter.
brew "derailed/popeye/popeye"
# Helm version manager inspired by tfenv
brew "little-angry-clouds/my-brews/helmenv", link: false
# Command-line helper for the 1Password password manager
cask "1password-cli", args: { appdir: "/Applications" }
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Clipboard extension app
cask "clipy"
# Official CLI tool for Concourse CI
cask "fly"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Development environment
cask "vagrant"
# Virtualizer for x86 hardware
cask "virtualbox"
# Extend the functionality of VirtualBox
cask "virtualbox-extension-pack"
# Open-source code editor
cask "visual-studio-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ban.troff"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "sumneko.lua"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
