# Taps
tap "alextodicescu/tgenv"
tap "derailed/popeye"
tap "electblake/awsp"
tap "hashicorp/tap"
tap "little-angry-clouds/my-brews"
tap "minamijoyo/hcledit"
tap "romkatv/powerlevel10k"
tap "warrensbox/tap"

###############################################################################
# CLI Tools - Shell & Terminal
###############################################################################
brew "zsh"                      # UNIX shell
brew "antigen"                  # Plugin manager for zsh
brew "spaceship"                # Zsh prompt for Astronauts
brew "zsh-autosuggestions"      # Fish-like autosuggestions
brew "zsh-syntax-highlighting"  # Syntax highlighting for zsh
brew "autojump"                 # Shell extension to jump to directories
brew "fzf"                      # Command-line fuzzy finder
brew "direnv"                   # Load/unload env vars based on $PWD
brew "stow"                     # Symlink farm manager for dotfiles
brew "tree"                     # Display directories as trees

###############################################################################
# CLI Tools - File & Text Processing
###############################################################################
brew "ripgrep"                  # Search tool like grep (rg)
brew "the_silver_searcher"      # Code-search similar to ack (ag)
brew "jq"                       # Lightweight JSON processor
brew "grep"                     # GNU grep
brew "curl"                     # Get files from HTTP/HTTPS/FTP
brew "wget"                     # Internet file retriever
brew "ncdu"                     # NCurses Disk Usage
brew "highlight"                # Source code to formatted text
brew "jp2a"                     # Convert JPG images to ASCII

###############################################################################
# Development - Version Control
###############################################################################
brew "git"                      # Distributed version control
brew "gh"                       # GitHub CLI
brew "lazygit"                  # Simple terminal UI for git
brew "pre-commit"               # Framework for pre-commit hooks

###############################################################################
# Development - Languages & Runtimes
###############################################################################
brew "asdf"                     # Extendable version manager
brew "go"                       # Go programming language
brew "rust"                     # Rust programming language
brew "rustup"                   # Rust toolchain installer
brew "node"                     # Node.js
brew "yarn"                     # JavaScript package manager
brew "python@3.10"              # Python 3.10
brew "python@3.9"               # Python 3.9
brew "pipenv"                   # Python dependency management
brew "openjdk"                  # Java Development Kit
brew "perl"                     # Perl programming language

###############################################################################
# Development - Build Tools
###############################################################################
brew "cmake"                    # Cross-platform make
brew "make"                     # GNU make
brew "shellcheck"               # Static analysis for shell scripts

###############################################################################
# Development - Rust/Cargo Tools
###############################################################################
brew "cargo-outdated"           # Cargo subcommand for outdated deps

###############################################################################
# Cloud - AWS
###############################################################################
brew "awscli"                   # Official AWS CLI
brew "awscurl"                  # Curl-like access to AWS resources
brew "aws-vault"                # Securely store AWS credentials
brew "electblake/awsp/awsp"     # AWS profile switcher

###############################################################################
# Cloud - Kubernetes & Containers
###############################################################################
brew "docker"                   # Docker CLI
brew "docker-credential-helper" # Platform keystore for Docker
brew "docker-machine"           # Create Docker hosts
brew "docker-machine-nfs"       # NFS for docker-machine
brew "podman"                   # Container management tool
brew "qemu"                     # Machine emulator (for podman)
brew "k9s"                      # Kubernetes CLI dashboard
brew "kubectx"                  # Switch kubectl contexts (includes kubens)
brew "krew"                     # Package manager for kubectl plugins
brew "kube-ps1"                 # Kubernetes prompt info
brew "kind"                     # Run local K8s cluster in Docker
brew "kops"                     # K8s cluster management
brew "stern"                    # Tail multiple K8s pods
brew "velero"                   # K8s disaster recovery
brew "argocd"                   # GitOps Continuous Delivery

###############################################################################
# Cloud - Infrastructure as Code
###############################################################################
brew "tfenv"                    # Terraform version manager
brew "terraform-docs"           # Generate docs from Terraform
brew "tfsec"                    # Static analysis for Terraform
brew "terrascan"                # Detect compliance violations
brew "tfupdate"                 # Update Terraform version constraints
brew "checkov"                  # Prevent cloud misconfigurations
brew "infracost"                # Cost estimates for Terraform
brew "tgenv"                    # Terragrunt version manager
brew "serverless"               # Serverless framework

###############################################################################
# Cloud - Other Tools
###############################################################################
brew "derailed/popeye/popeye"               # Kubernetes cluster sanitizer
brew "little-angry-clouds/my-brews/helmenv" # Helm version manager
brew "minamijoyo/hcledit/hcledit"           # HCL editor
brew "prowler"                              # Cloud security assessments

###############################################################################
# Database & Networking
###############################################################################
brew "libpq"                    # Postgres C API library
brew "mongosh"                  # MongoDB Shell
brew "nmap"                     # Port scanning utility
brew "telnet"                   # TELNET client

###############################################################################
# Security & Encryption
###############################################################################
brew "gnupg"                    # GNU Privacy Guard (GPG)
brew "pwgen"                    # Password generator

###############################################################################
# Utilities
###############################################################################
brew "htop"                     # Interactive process viewer
brew "neovim"                   # Vim-fork editor
brew "zellij"                   # Terminal multiplexer
brew "graphviz"                 # Graph visualization
brew "cmatrix"                  # Console Matrix
brew "docutils"                 # reStructuredText processing
brew "bash"                     # Bourne-Again Shell

###############################################################################
# Casks - Applications
###############################################################################
cask "1password-cli"            # 1Password CLI
cask "alfred"                   # Application launcher
cask "aws-vault-binary"         # AWS credential storage
cask "docker-desktop"           # Docker Desktop
cask "fly"                      # Concourse CI CLI
cask "font-meslo-lg-nerd-font"  # Nerd Font for terminal
cask "iterm2"                   # Terminal emulator
cask "microsoft-auto-update"    # Microsoft update tool
cask "microsoft-office"         # Office suite
cask "microsoft-teams"          # Microsoft Teams
cask "pycharm-ce"               # Python IDE
cask "scroll-reverser"          # Reverse scroll direction
cask "vagrant"                  # Development environment
cask "visual-studio-code"       # Code editor
cask "warp"                     # Rust-based terminal
